" [Quark's]\n(Quark is holding a disc containing something.) \nQUARK: I am merely a businessman. It would take an orator with the\nskills of the late, great Plegg himself, to sing the praises of the\nlate, great Plegg. What Ferengi could resist the honour of owning a\nsmall piece of the man that took a computer chip and turned it into the\nmodular holosuite industry. A small piece of the man that brought\nholographic entertainment to the most remote parts of this quadrant,\ncreating profit centres from societies that could barely afford to feed\ntheir own people. \nODO: How much are you asking? \nQUARK: As I was about to tell my good friend here, a mere three strips\nof latinum. And I'd be taking a loss at that price. \n(His putative customer leaves) \nQUARK: Okay, for you, two strips. Thank you very much. \nODO: Three strips? That's a fair price for Plegg. \nQUARK: I suppose you're interested. \nODO: Humanoid death rituals are an interest of mine. \nQUARK: Death rituals? \nODO: Everybody needs a hobby. Some species burn their dead, others pack\nthem in blocks of ice. Some even surround themselves with the company\nof family corpses. But the Ferengi ritual of chopping up their loved\nones and selling them? I find that irresistible. \nQUARK: I'm very busy here. \nODO: What a fitting and distinguished way to honour the memory of great\nFerengi entrepreneurs. I'm thinking of starting a collection, putting\nup a display case in my office. There'll be a special space in there\nreserved for you, Quark. \nQUARK: I'm sure. \n(Odo holds out three strips of latinum) \nQUARK: You're serious? \nODO: Have you ever known me not to be? \n(Quark fetches a disc of Plegg and reaches for the latinum) \nODO: There is one thing I was curious about. \nQUARK: And what's that \nODO: How do I know it's Plegg? \nQUARK: It says so on the label. \nODO: Isn't there some sort of letter of authenticity? \nQUARK: The Ferengi Seal of Dismemberment is right there. What more do\nyou want? \nODO: I want Plegg. \nQUARK: You've got him. \nODO: Not if he's still alive. \nQUARK: Still alive? \nODO: Still alive. \nQUARK: Plegg? \nODO: After I tracked him down on Khosla Two and told him about your\nlittle scheme, he was quite amused. I'm not. \nQUARK: Odo, I'm a victim here. I bought these discs in good faith. I\nhave five thousand pieces of Plegg in my storeroom. \nODO: Not Plegg. \nQUARK: Then who? \nODO: Good question. \nQUARK: I demand an investigation. \nODO: You'll get one, I promise you. \nMORA: Odo! \n(Odo turns to see a Bajoran man who looks similar to himself. Everyone\nsay Hi! to James\nSloyan) \nODO: Doctor Mora. \nMORA: It's been too long. You're looking well. Yes, coming along\nnicely. \nODO: Why didn't you let me know that you were coming? \nMORA: It was a last minute arrangement. \nODO: The trip from Bajor takes five hours. \nQUARK: Can I get you something, Doctor Mora, was it? \nMORA: Yes, some Deka tea would be nice. Haven't quite managed the ears\nyet, have you? Oh, no, but they're difficult. Is the suit a suit, or\npart of you? And what about the boots? \nQUARK: Here we are, nice and hot. \nMORA: Thank you. \nQUARK: So, you two seem to be old friends. \nODO: Doctor Mora is the Bajoran scientist who was assigned to me after\nI was found. \nMORA: I was personally responsible for his development during his\nformative years. \nQUARK: So this is a family reunion! I had a hunch. Well, Odo's dad is\nalways welcome at Quark's. \nMORA: Well, actually I \nODO: He's not my \nQUARK: I know he wouldn't tell you himself, but Odo is doing a\nwonderful job here on the station, if I may say so. \nMORA: Is he? \nQUARK: Absolutely. As a matter of fact, when you came in, he was just\nbeginning a fraud investigation. \nODO: Quark! Excuse us. \nQUARK: Of course. The two of you have a lot of catching up to do. If\nthere's anything I can help you with, Doctor, don't hesitate to call on\nme.\n [Promenade]\nMORA: That was uncalled for. \nODO: You don't know Quark. \nMORA: I know that he was trying very hard to present you in a positive\nlight to someone he thought was important to you, and you responded\nwith \nODO: Please. \nMORA: Still having trouble with social integration? \nODO: I integrate as much as I want to. \nMORA: Define as much as I want to. \nODO: As much as I want to means, as much as I want to. [Replimat]\nODO: Quark is a thief, a con man, nobody you want\nto know. \nMORA: So, tell me about this police thing you've gotten yourself\ninvolved with. Is it working out? \nODO: I enjoy my work as Chief of Security. \nMORA: Chief of Security at a way-station in space. Don't you miss it,\nOdo? \nODO: What? \nMORA: Our work. \nODO: Never. \nMORA: I don't believe it. I know you too well. You were unhappy in the\nlab, I can't blame you for that. But the work, Odo, the work. The\nexploration of you, what you are, where you came from. That's never far\nfrom your mind, is it. \nODO: That part of it is true. \nMORA: Good. Because I came here counting on that.\n [Sisko's quarters]\nJAKE: See you later, Dad. \nSISKO: Hey, hey, hey, hey. Hold on. \nJAKE: I'm late. \nSISKO: For what? \nJAKE: For Nog. \nSISKO: Your homework. \nJAKE: It's done. \nSISKO: You've studied that whole Klingon opera for the music test on\nFriday? \nJAKE: I'm going to ace the test, Dad, I promise. \nSISKO: This isn't about tests, Jake. This is about learning. You can't\nlearn to appreciate Klingon opera by cramming for the exam the night\nbefore. \nJAKE: What am I ever going to use Klingon opera for? \nSISKO: Well, first of all, you don't know what you're going to be when\nyou grow up. You may discover along the way that you want to be a\nmusician, or you may find yourself among some Klingons in a job\nsomewhere. \nJAKE: Dad, even if I did, they wouldn't be going around singing operas.\n\nSISKO: It helps to understand their culture. \nJAKE: When was the last time you listened to Klingon opera? \nSISKO: When I was your age. \nJAKE: There, you see? \nSISKO: Yes. Do you? \nJAKE: Just because you suffered through all that doesn't mean I have\nto. \nSISKO: Yes, it does. \n(doorbell) \nSISKO: Come in. \nJAKE: Dad. \n(Odo enters) \nSISKO: I have the perfect solution. Nog has the same test. Why don't\nyou invite him over and you can listen to the Klingon opera together? \n(Jake goes back to his room) \nSISKO: Please, Odo, sit down. \nODO: Commander, I'd like to request the use of a runabout. \nSISKO: Of course. For what? \nODO: A Doctor Mora Pol from the Bajoran Institute of Science has asked\nme to help him secure one from the Federation. \nSISKO: Why did he come to you? \nODO: Doctor Mora is the scientist who was assigned to me in my first\nyears here. If he went to the Board of Ministers to request permission\nto approach you, it would take months, and he's very anxious to\ninvestigate something in the Gamma Quadrant. And may I say, Commander,\nso am I. \nSISKO: You've got me curious, Constable. Is it a secret? \nODO: No, but there isn't much to tell. One of the Bajoran science\nprobes recently scanned a planet about six light years from the\nwormhole. It picked up some very unique and familiar DNA patterns.\nPatterns very much like my own, Commander. Doctor Mora thinks he may\nhave discovered the origin of my people. Of me.  [Runabout Rio Grande]\n(WHOOSH, and into the Gamma quadrant. The runabout\nis being piloted by a younger Bajoran man.) \nMORA: It would seem to me that being a scientist yourself, Lieutenant,\nyou can appreciate the difficulty of our dilemma, and the elegance of\nthe solution. When Odo was first found, nobody knew who, or indeed,\nwhat it was we were dealing with. A shapeless, viscous mass of fluid, a\nveritable organic broth. That was our Odo in the beginning. \nDAX: When did you realise you were dealing with a sentient lifeform? \nODO: He didn't. I had to teach him that myself. \nMORA: It's true. It's very true. Tell her. \nODO: It was a dilemma for me. I had never seen anything like these\ncreatures either. \nMORA: Seen isn't really an appropriate description. He had no eyes per\nse. \nODO: I was just trying to describe it in simple terms. \nMORA: He had never perceived anything like us before. Go on. \nODO: I knew I had to find some way to communicate with them. So I\ntransformed myself into \nMORA: It was remarkable. Every morning I would come into the lab, and\nevery morning Odo would be there resting in his liquid form in a Krokan\npetri beaker. One morning I walked in and Odo was gone. The beaker was\nempty, but next to it was an identical beaker that had not been there\nbefore. A perfect replica in every way. It was amazing. It hasn't been\nthe same since you've gone, Odo. Working with you has been the most\nrewarding part of my career. \nDAX: We're approaching the planet. Prepare to enter standard orbit.\nPlanet designated L S Six. \nWELD: Initiating scans. \nDAX: There's a lot of seismic activity down there, possibly volcanic in\norigin. Moving into synchronous orbit.  [Planet surface] (The four beam down to a ruined stone settlement.\nThere is a stele, a carved pillar in the middle, which immediately\ngrabs Odo's interest.) \nMORA: Do the letters mean anything to you? \nODO: No. I don't think so. \nMORA: Judging by its position in the ruins, I think it's fair to say\nthat this pillar represented something important to the people who\nlived here. \nDAX: Why don't we take it with us. Our computers back on the station\nmight be able to decipher the inscriptions. \nMORA: Where is Doctor Weld? Doctor Weld? \nWELD: Over here. (putting something in a sample case) I think I may\nhave found what we're looking for. \n(He pours some purple powder into a dish for Odo to look at.) \nMORA: Is it carbon based? \nWELD: No, silicate, but vegetative, and very much alive. \n(The powder morphs slightly) \nMORA: Odo Junior, perhaps. \nDAX: Computer, begin transport. \n(The stele is beamed out then there's an earthquake. The ruins start to\nfall.) \nDAX: Computer, realign transporter. Lock on to our comm. badges. \nCOMPUTER: Stand by. \n(Mora falls, Odo helps him up) \nODO: This way. \n(Gas spews from a fissure and the humanoids start to collapse) \nCOMPUTER: Ready for transport. \nODO: Computer, energise!\n[Infirmary]\nBASHIR: They're stable for now. Dax is in fair\ncondition. The Bajorans seem to be more seriously affected. Perhaps\nthey were exposed to more of the gas, or there may be something about\nTrill physiology. I'm not sure yet. \nSISKO: And Odo? \nODO: I'm fine. \nBASHIR: The paralysing action occurred when the gas was taken into the\nrespiratory system. Since Odo doesn't have a respiratory system as we\nknow it, he apparently wasn't affected at all. \nSISKO: O'Brien's off-loaded the cargo they brought back. He has set up\neverything in the Science Lab. I understand there are some organic\nspecimens from that planet. Maybe there's something that will help you\nfigure this out. \nBASHIR: Good idea. \nODO: (re Mora) Will he be all right? \nBASHIR: The molecule appears to have quite an unstable structure. That\nmight mean the effect is temporary.\n [Promenade] SISKO: I know how you feel, Constable. \nODO: Feel? About what? \nSISKO: When my father became ill I can remember how small and weak he\nlooked lying there in the bed. He'd been so strong, so independent. It\nalways seemed to me there was nothing that he couldn't do. But in the\nend, I realised that there was nothing that he could do, and nothing I\ncould do to help him. \nODO: I appreciate your thoughts, Commander, but Doctor Mora is not my\nfather.\n [Science lab] O'BRIEN: The computer's having a hard time\nclassifying your new lifeform. \nODO: Why? \nO'BRIEN: Whatever it is, it keeps changing. Somehow it goes through a\nmetamorphosis every time it reproduces, and it reproduces like crazy.\nLook at this. It's multiplied so much I had to change containers. I'll\nput it in a level five security field overnight. I wish Dax were here\nto take a look at it. How's she doing? \nODO: Doctor Bashir thinks she'll be fine. \n(Odo stares at the stele) \nO'BRIEN: Any idea what it is? \nODO: I'm hoping it's a key, Mister O'Brien. A key to my past.\n [Sisko's bedroom]\nKIRA [OC]: Kira to Sisko. \nSISKO: Go ahead, Major \nKIRA [OC]: Sorry to bother you, Commander, but we need you up here in\nthe Science lab. \nSISKO: I'm on my way.\n [Science lab]\n(The lab has been trashed and people are wandering\naround with tricorders. The specimen container has burst from the\ninside.) \nSISKO: Any signs of a break-in? \nKIRA: Not that we could find. The security seal on the lab was still in\nplace when we got here. \nO'BRIEN: I can't imagine why anyone would want to steal that thing\nanyway. \nSISKO: You're suggesting the lifeform itself did this. \nO'BRIEN: I don't know what did this. Commander. Unless a tornado passed\nthis way without us hearing it. The room was locked. It's gone. That's\nall I know for now. \nSISKO: Constable, get a level three Security scan underway on the\nentire station. \nO'BRIEN: Our scanners may have trouble finding this lifeform. It has\nmetamorphic qualities that were confusing the computer. You might want\nto run that sweep two or three times. \nSISKO: Let's go to Yellow alert. \nODO: Major, you could help me by reviewing the security camera records\nand the heat sensor readouts for the Lab and the surrounding areas. \n(Kira leaves) \nO'BRIEN: Commander, I'm picking up slight trace elements near the\nventilation intake duct. It looks as though our lifeform may have taken\nthis way out. \n(Dax enters) \nSISKO: Doctor Bashir give you permission to be up and about? \nDAX: Doctor Bashir wouldn't listen to me and hid my clothes so I\nwouldn't leave. I had to sneak out to my quarters in a hospital gown\nthat wouldn't close in the back. What did this? \nSISKO: The working theory is that lifeform you brought back is somehow\nresponsible. \nDAX: I don't believe it. \nSISKO: Good. Find me a better theory. \nDAX: Odo, Doctor Mora is awake and would like to speak with you.\n [Infirmary] MORA: I heard them say something had happened in\nthe lab. \nODO: The lifeform sample is gone. \nMORA: Gone? \nODO: We're not sure how or why yet. \nMORA: I want to help. \nODO: Everything is under control. \nMORA: I know more about shape-shifters than anyone in this sector. \nODO: Anyone except me, and I'll be running the investigation. Besides\nwe're not even sure it is a shape-shifting lifeform. \nMORA: Any metamorphic characteristics? \nODO: It was changing faster than the computer could analyse. \nMORA: Any indication of intelligence? \nODO: Not unless you consider wanton destruction of the lab an\nindication of intelligence. \nMORA: It might be. It might be. Don't dismiss any possibility. Doctor\nWeld hasn't regained consciousness. I feel responsible. \nODO: I'm sure Doctor Bashir is doing everything possible.\n [Conduit]\nO'BRIEN: The same trace elements are inside the\nduct.  [Security office] O'BRIEN [OC]: I'm following the trail. Moving\ntoward corridor two H. \nSISKO: Nothing's showing up anywhere on the scanners, Chief. \nO'BRIEN [OC]: Yeah, I figured as much.  [Conduit]\nO'BRIEN: Did the security cameras in the lab give\nyou anything? \nODO [OC]: The security cameras stopped operating for forty-three\nseconds at zero three hundred hours, five minutes right when the alarm\nsounded \nO'BRIEN: Stopped? You mean somebody turned them off.\n [Security office] SISKO: More likely some kind of power interruption.\nIt might have affected the security field around the lifeform too.\nWe're trying to analyse it now.  [Conduit]\nO'BRIEN: Do the heat sensors in the lab show any\nthermal deviation at the same time? \nSISKO [OC]: Almost a six degree increase during the forty-three\nseconds. \nO'BRIEN: But then back to normal after that? \nSISKO [OC]: Affirmative. \nO'BRIEN: We might be dealing with an entity that absorbs low frequency\nRF energy.\n [Security office] O'BRIEN [OC]: It might be feeding off our power. \nODO: But an energy drain should be showing up on our scans.  [Conduit]\nO'BRIEN: Yeah, that's true, Constable. I don't get\nit. Maybe this thermal deviation was the result of (rattle) \nSISKO [OC]: Chief? \nO'BRIEN: Hold on, I hear something.\n [Security office] SISKO: We've got your position. Nothing else is\nshowing up anywhere near you.  [Conduit]\nO'BRIEN: Well, I definitely hear something ahead.\nCan you hear it on the comm. line?  [Security office] SISKO: No.  [Conduit] O'BRIEN: It almost sounds like. I can't describe\nit. I'm moving in closer. If you run into my wife, don't mention I did\nthis.  [Security office]\nSISKO: Move some backup to the nearest corridor. \nODO: Security to core section, level four, corridor two H. \nO'BRIEN [OC]: I'll come home tonight and she'll ask me how  [Conduit]\nO'BRIEN: My day was and I'll say, fine, honey, how\nwas yours? Sometimes I think she really doesn't want to know the truth,\nso I do us both a favour and \n(He's reached a junction.) \nO'BRIEN: It's a structural breach. Ahhh! [Security office]\nSISKO: O'Brien, report! [Conduit]\n(Gloop is falling from the breach onto O'Brien's\narm) \nO'BRIEN: I'm okay. I'm fine. I found our missing lifeform. Except it\nisn't a lifeform anymore. It's dead.\nStation log, stardate 47391.7. Engineering crews\nhave been working for over fifteen hours searching conduits. There have\nbeen no additional incidents and no further evidence of the alien\nlifeform has been found.  [Infirmary] BASHIR: With this kind of cellular structure, the\nlifeform would have needed a higher concentration of carbon dioxide\nthan our atmosphere provides. \nDAX: It just couldn't survive out of its own environment. \nBASHIR: That'd be my analysis. \nDAX: But with that in mind, do you still think this lifeform was\ncapable of destroying the lab? \nBASHIR: That's not impossible. The environmental impact might have\ntaken some time to set in. \nDAX: I'd really like to get Doctor Mora's opinion on all this. \nBASHIR: He's much better. He should be up and around in the morning. \nDAX: Feel like getting a raktajino before we call it a night? \nBASHIR: My replicator or yours? \nDAX: I was thinking more of the Promenade. \nBASHIR: I knew that. Well, thanks anyway. I've got a few things to wrap\nup around here. \nDAX: Sleep tight, Julian. \n(Dax leaves) \nBASHIR: She enjoys it. She actually gets some kind of perverse pleasure\nout of it. One of these days I'm going to stop chasing her, and then\nwe'll see. \n(There's a noise from the inner ward. As Bashir checks on his patients\ncomes down through the ceiling vent and wraps a tentacle around his\nneck. He manages to get a laser scalpel and wound it. Mora wakes as it\ndisappears into the ventilation grill again.) \nBASHIR: Emergency. Emergency! Intruder alert. \n(Later, forensics have arrived and O'Brien has scanned the vent.) \nBASHIR: It happened so quickly. I'm sorry I can't tell you any more\nabout it. It was behind me, and then it was gone. But it was big, very\nbig. \nSISKO: How badly did you injure it? \nBASHIR: I don't know. I don't even know if I injured it at all. I just\nhit it once with a laser scalpel on the arm, or the leg, or the\ntentacle, or whatever it was, and then it went up the wall and was\ngone. \nMORA: It appears as though our lifeform has survived and grown into\nsomething interesting. \nODO: Did you notice anything else when you entered the room, Doctor?\nAnything out of place, anything unusual. Was it unusually warm,\nperhaps? \nBASHIR: Now that you come to mention it, it was a bit warm in here. \nODO: Another thermal distortion. Did you try the lights, Doctor? \nBASHIR: No, I didn't want to disturb the patients. \nODO: Commander, I suggest we check the RF energy flow to the Infirmary.\nWe might find a power interruption as we did in the lab. \nDAX: No blood or any fluid traces, but I am picking up a very slight\ntrail of something we didn't see last time. An organic residue. \nSISKO: Enough to test? \nDAX: We'll see. \n(Dax leaves) \nSISKO: Sisko to Ops. \nKIRA [OC]: Go ahead. \nSISKO: Restrict all nonessential personnel to their quarters and go to\nRed alert, Major. \nKIRA [OC]: Understood. \nSISKO: Keep in touch with Dax's progress. She might give us a way to\ntrack this thing. \nODO: Until we can, I suggest we close down the Promenade. \nSISKO: I'll give the order, Constable. \nMORA: Constable? \nODO: It's a nickname that I barely tolerate. \nMORA: It's the expression of affection that you find difficult to\naccept.\n [Promenade]\nMORA: You know, that was really a remarkable\ndisplay back there. \nODO: Display? \nMORA: You were very careful, attentive. \nODO: I was just doing my job. \nMORA: I'm beginning to think that the scientific method and police\nmethod have a lot in common. \nODO: I never thought of it that way. Perhaps they do. \nMORA: In science we look for the obvious. We track in straight lines.\nIf something looks too good to be true, it usually isn't true. If there\nappears to be more to something than meets the eye, there usually is\nmore. We take it step by step. \nODO: That applies to criminal investigation as well. \nMORA: You do it very well. I'm very proud of you, Odo. Do you know\nthat?\n [Science lab] ODO: Anything? \nDAX: The computer's having trouble breaking down the DNA chains. \nMORA: What about this pillar? Did the computer have any success\ndecoding the encryptions? \nDAX: No luck there either. All things considered, the computer's having\na bad week. We have such a limited database for the Gamma Quadrant. \nODO: I have to close down the Promenade. Call me when you have\nsomething. Wasn't that pillar over here before? \nDAX: It was in my way. I had it moved. \n(Odo leaves) \nMORA: Have you compared this new organic strain to the lifeforms we\nbrought back from the planet? \nDAX: Only enough to be sure that they're not the same. \nMORA: It might be interesting to see if there are any commonalties at\nall. \nDAX: Let me run a cross-tabulation analysis. It should only take a few\nminutes. \nMORA: Do you know Odo well, Lieutenant? \nDAX: Not as well as I'd like to. He keeps to himself a lot. \nMORA: I'm not surprised. I never realised until I actually saw him how\nmuch I missed him. We didn't part on very good terms. \nDAX: So I've heard. \nMORA: He wanted to leave and we still had so much work left to do. But\nI see him now and I wonder if he wasn't right to go. After all, he's\ncome so far. \nDAX: He's an invaluable man around here. \nMORA: I never thought he could do it. Integrate successfully. If you\ncould have seen him before. He\nwas so ill-prepared to be on his own. I was sure he'd come back. I told\nhim when he left, he'd come back, and all these years I was so certain\nthat eventually one day he'd show up at the lab. Well, I guess I'd\nbetter get used to the idea he's not going to. \nDAX: Here we are. \nMORA: Which one's this? \nDAX: This is the new one from the Infirmary, and this is the lifeform\nfrom the planet. But remember it went through several metamorphoses. \nMORA: It's not the same entity. The nucleotide sequences are entirely\ndifferent. \nDAX: Some metachromic similarities. \nMORA: Yes, on a most basic level. At best they could be distant\ncousins. \nDAX: The computer's broken down the DNA chain on the new sample. I can\nrun an analysis and see if it matches up with any other lifeform in the\ncomputer. \nMORA: How long would that take? \nDAX: Two, three hours, maybe. \nMORA: Let me know.\n [Security office] ODO: Doctor Weld has regained consciousness. It\nlooks like he'll be fine. \nMORA: That's a relief. \nODO: You don't seem relieved. \nMORA: You can tell that just by observing me, the tone of my voice, my\neyes, my body movements? \nODO: Yes. \nMORA: You are truly a remarkable lifeform, Odo. But there is so much\nabout you we still don't understand. \nODO: What are you getting at, Doctor? \nMORA: The computer has broken down the DNA chain from the organic\nsample we found in the Infirmary. Dax is running an analysis of it now.\nShe'll identify it in a couple of hours. But I already know what it is.\nI've seen it before. The organic sample, it's from you, Odo. \n(Gasps and adverts) \nMORA: The destruction in the science lab occurred at zero three hundred\nhours, five minutes. The attack in the Infirmary occurred at nineteen\nthirty five. Roughly sixteen hours apart. Is your rejuvenation period\nstill sixteen hours? \nODO: I was in my pail during both attacks. \nMORA: But were you? I don't think so. I think, Odo, that you've been in\nthe ironic position of having to track down yourself. \nODO: How could this be? \nMORA: Has anything like this ever occurred before? \nODO: Of course not. \nMORA: Are you certain? \nODO: Yes, I'm certain. There would have been incidents. \nMORA: Any unsolved crimes on the books? \nODO: There are always unsolved crimes. \nMORA: Then the possibility exists. \nODO: It doesn't! I do not commit criminal acts. It is not in my nature.\n\nMORA: Isn't it? \nODO: The gas. Maybe it was the gas on the planet. It affected all of\nyou, it must have done something to me. \nMORA: A possibility. \nODO: That has to be it. \nMORA: It's certainly worth of an investigation. \nODO: Doctor Bashir \nMORA: Doctor Bashir will not understand any of this, except that you\nturned into some kind of uncontrolled thing that tried to kill him.\nReally, Odo. What do you think they'll do with you? \nODO: Do? \nMORA: They won't know what to do with you. They'll put you in a high\nsecurity prison, or quarantine you on a deserted asteroid in the Gamma\nQuadrant. Odo, they'll put you in a zoo. \nODO: I don't believe that. You don't know them. \nMORA: What other humanoid have you been able to trust except me? \nODO: What makes you think I trust you? \nMORA: I resent that. I really do. After the time I invested in you,\nafter the education I gave you, the attention I gave you. You would not\nbe here today if it were not for my guidance. I gave you more than\nanyone else in my life. You were my life. And then you walked away. And\nnow you don't trust me? Fine. Put yourself in their hands then. You\nalways had to learn your lessons the hard way, didn't you. \n(Odo is very anguished and looking rather moist) \nODO: I am not going back to the centre with you. \nMORA: Why? We'll work through this together. We'll solve it together,\njust like we used to. \nODO: No! \n(Odo slams his hands onto his console. Electricity courses through them\nand they start to morph. We hear a large roaring creature as Mora backs\nout of the office)\n [Ops]\nO'BRIEN: I have a power failure in Security,\nCommander. \nSISKO: Sisko to Odo. Sisko to Odo. \nKIRA: All deputies report to the Security Office. Possible intruder. \nO'BRIEN: I'm tracking it. We have a power drain in the life support\nconduit above the Security Office. If it's feeding off our power, we\nmay be able to slow it down by shutting off the primary flow to the\nentire core section. \nSISKO: Do it. Where the hell did it come from? \nSECURITY [OC]: Security to Ops. \nKIRA: Go ahead. \nSECURITY [OC]: There's no one down here, Major. \nKIRA: And there's no sign of Odo? \nSECURITY [OC]: No, sir. \nMORA: I can help you with that, Major. The creature you're after is\nOdo. There must have been some kind of metamorphic reaction to the\nvolcanic gas that we encountered on the planet. \nSISKO: Is there any way to communicate with him? \nMORA: I don't know. It's not Odo really. It's separate and independent\nfrom the Odo we know, and yet, at the very least, it's aware of me. \nKIRA: How can you know that? \nMORA: The incident in the science lab. I believe that was an attempt to\nrescue the lifeforms I placed in containment. The second encounter\noccurred in the Infirmary where I was asleep. The third happened just a\ncouple of minutes ago when we got into a heated discussion in Security.\nI think that even the Constable himself would arrive at the same\nconclusions given the evidence. On some instinctual level, this\ncreature is familiar with me. \nSISKO: He might even conclude it has hostile intentions toward you. \nMORA: It had occurred to me. \nO'BRIEN: The power shutdown is complete, Commander. Odo, or whatever it\nis in there, has stopped moving for the moment. \nSISKO: Chief, based on your knowledge of its behaviour, if we can lure\nhim out, is there any way we can set up a forcefield to hold him? \nO'BRIEN: We could reverse polarity on the energy fields. That might\nwork, but that's only a guess. \nSISKO: Set it up on the Promenade. I want a lot of room to operate.\nMajor, station security teams along the perimeter. \nKIRA: How are we going to get him to come out of the conduits? \nO'BRIEN: Maybe I could use some RF energy bursts to attract him. \nMORA: There's only one way that you're going to attract that creature\ninto your trap. It's me it's after.\n [Promenade]\nSISKO: Mister O'Brien? \nO'BRIEN [OC]: Our plan seems to be working, Commander. He's following\nmy trail of energy crumbs directly toward you. \nSISKO: On my signal, open the conduit and let him in. \nO'BRIEN [OC]: Aye, sir. \nSISKO: We're not sure which vent he'll come through. Hopefully, it'll\nbe the first one available to him over there. If not, there are\nseventeen others he may choose. We're not stationing officers near any\nof them. We don't want to scare him away. \nMORA: I understand. \nSISKO: Just get him to the forcefield. We'll do the rest. Pass the word\nthat phasers are to be set on maximum stun. The moment Doctor Mora\nappears to be in jeopardy, I'll open fire. Their orders are to follow\nmy lead. If maximum stun doesn't bring him down immediately, we set\nphasers to kill. \nKIRA: Commander. \nSISKO: I know, Major. Those are my orders. Mister O'Brien. [Ops]\nSISKO [OC]: We're ready. \nO'BRIEN: Releasing the conduit seal. [Promenade]\nSISKO: Doctor Mora, did you hear that? \nMORA: Ready and waiting. \n(Everyone peers into the gloom from their hiding places. Starfleet\nsecurity are in force on the upper level) \nMORA: What are you waiting for? I'm here, and I'm not going anywhere. \n(An amorphous mass drops to the floor behind him, rears up and gets\ncaught by the forcefield, Forbidden Planet style.) \nMORA: I've done it to you again, haven't I, Odo? Made you a prisoner?\nDear God, what have I done? \nSISKO: Mister O'Brien, drop the forcefield. \nO'BRIEN [OC]: Aye, sir. \n(The energy stops coursing through the creature and it turns back into\nOdo, who collapses. Bashir runs an instrument over him.) \nMORA: We have a lot to talk about.  [Infirmary]\nBASHIR: I'm not going to try and explain exactly\nwhat happened to you, Odo, because I haven't the vaguest idea. I can\ntell you that with Doctor Mora's help we've managed to eliminate all\ntraces of the gas from your cellular structure. I prescribe rest\nbecause it's hard for a doctor to go wrong with that one. Otherwise,\nthere's not much more I can do for you. \nODO: Thank you, Doctor. \n(Bashir leaves) \nMORA: I'm going home. \nODO: Doctor Mora, I want to be sure you understand, I had no idea. \nMORA: You had to speak in a voice loud enough for me to hear. \nODO: I'm sorry. \nMORA: I'm sorry it was necessary. I would like, in a very small way, to\nbe a part of your life again. Your life here on the station. From time\nto time, we could talk about things that matter to you. To us. \nODO: I'd like that. "